ХМНПФ_Общее/DataProcessors/Удалитьуп_ЗагрузкаФайловПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Удалитьуп_ЗагрузкаФайловПФР</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РегистрацияПоступленийОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РегистрацияПоступленийОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КатегорияВзноса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_КатегорияВзносаОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоНераспределенныйПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаКонцаПериодаВзносов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ЭтоПоступлениеПоПереходу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДополнительныеСведенияОВзносах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрироватьНоминал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗачитыватьВиртуальныеВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВосполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСредств</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыВозвращаемыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ГодИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ПодтверждениеПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПодтверждениеПФР</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПредыдущийСтраховщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Catalogs/уп_ДоговорыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ДоговорыОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНазначенияНЧТП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокНЧТППриНазначении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/Удалитьуп_ЗагрузкаФайловПФР/Ext/ObjectModule.bsl
// ХМНПФ 23.03.2016 ЛыткинАМ // Новая ХМ_РассчитатьДокументы() // №296
Процедура ХМ_РассчитатьДокументы(ТабНайденныхДоговоров, ФайлЗапроса, ДокументРегистрации, Протокол)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабНайденныхДоговоров.ДО2015,
		|	ТабНайденныхДоговоров.ДоговорОПС,
		|	ТабНайденныхДоговоров.Участник,
		|	ТабНайденныхДоговоров.ПФ,
		|	ТабНайденныхДоговоров.Состояние
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ТабНайденныхДоговоров КАК ТабНайденныхДоговоров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговыйЗапрос.ДоговорОПС,
		|	ИтоговыйЗапрос.Участник,
		|	ИтоговыйЗапрос.ПФ,
		|	ИтоговыйЗапрос.Состояние,
		|	ВЫБОР
		|		КОГДА ИтоговыйЗапрос.ДО2015 = ИСТИНА
		|			ТОГДА ИСТИНА
		|		КОГДА МИНИМУМ(ЕСТЬNULL(уп_СостоянияДоговораОПС_ДатаВступленияВСилу.Период, &ДатаДок)) < &Начало2012
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВыплачиватьИД
		|ПОМЕСТИТЬ Итоговый2
		|ИЗ
		|	ИсходныеДанные КАК ИтоговыйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС КАК уп_СостоянияДоговораОПС_ДатаВступленияВСилу
		|		ПО ИтоговыйЗапрос.ДоговорОПС = уп_СостоянияДоговораОПС_ДатаВступленияВСилу.ДоговорОПС
		|			И (уп_СостоянияДоговораОПС_ДатаВступленияВСилу.Период <= &ДатаДок)
		|			И (уп_СостоянияДоговораОПС_ДатаВступленияВСилу.Состояние = &НП ИЛИ уп_СостоянияДоговораОПС_ДатаВступленияВСилу.Состояние = &ОПВ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговыйЗапрос.ДО2015,
		|	ИтоговыйЗапрос.ДоговорОПС,
		|	ИтоговыйЗапрос.Участник,
		|	ИтоговыйЗапрос.ПФ,
		|	ИтоговыйЗапрос.Состояние
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итоговый2.ДоговорОПС,
		|	Итоговый2.Участник,
		|	Итоговый2.ПФ,
		|	Итоговый2.Состояние
		|ИЗ
		|	Итоговый2 КАК Итоговый2
		|ГДЕ
		|	Итоговый2.ВыплачиватьИД = &ВыплачиватьИД";
	Запрос.УстановитьПараметр("ТабНайденныхДоговоров", ТабНайденныхДоговоров);
	Запрос.УстановитьПараметр("ДатаДок", ДатаФормированияДокументов-1);
	Запрос.УстановитьПараметр("НП", Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
	Запрос.УстановитьПараметр("ОПВ", Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПоступленияВзносов);
	Запрос.УстановитьПараметр("Начало2012", '20120101000000');
	
	ХМ_ВыплачиватьИД = Истина;
	Запрос.УстановитьПараметр("ВыплачиватьИД", ХМ_ВыплачиватьИД);
	ТабНайденныхДоговоров_2 = Запрос.Выполнить().Выгрузить();
	РассчитатьДокументы(ТабНайденныхДоговоров_2,ФайлЗапроса, ДокументРегистрации, Протокол, ХМ_ВыплачиватьИД, Ложь, Неопределено);
	
	ХМ_ВыплачиватьИД = Ложь;
	Запрос.УстановитьПараметр("ВыплачиватьИД", ХМ_ВыплачиватьИД);
	ТабНайденныхДоговоров_2 = Запрос.Выполнить().Выгрузить();
	РассчитатьДокументы(ТабНайденныхДоговоров_2,ФайлЗапроса, ДокументРегистрации, Протокол, ХМ_ВыплачиватьИД, Ложь, Неопределено);
	
Конецпроцедуры	

// ХМНПФ 05.04.2016 ЛыткинАМ // Новая ХМ_ПолучитьПодходящийПоСостояниюДоговор() // №286
Функция ХМ_ПолучитьПодходящийПоСостояниюДоговор(ВыборкаДетальныеЗаписи,Протокол)
	ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
	СНИЛС = ВыборкаДетальныеЗаписи.СНИЛС;
	Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Заключен 
		ИЛИ ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР 
		ИЛИ ВыборкаДетальныеЗаписи.Состояние = null
		ИЛИ ВыборкаДетальныеЗаписи.Состояние = Неопределено
		Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Заключен 
				И НЕ  ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
				И НЕ  ВыборкаДетальныеЗаписи.Состояние = null
				И НЕ  ВыборкаДетальныеЗаписи.Состояние = Неопределено
				Тогда
				Возврат Истина;	
			КонецЕсли;	
		КонецЦикла;
	Иначе
		Возврат Истина
	КонецЕсли;	
	Протокол.ДобавитьСтроку("Для "+ДоговорОПС.Участник.Наименование
	+", страховой номер ПФР "+СНИЛС+" не найден подходящий по состоянию договор!");
	Возврат Ложь;
КонецФункции

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 22.03.2016 ЛыткинАМ // ЗагрузитьПодтверждениеИзПФР() // №286
	// ХМНПФ 22.03.2016 ЛыткинАМ // ЗагрузитьПодтверждениеИзНПФ() // №286
	// ХМНПФ 23.03.2016 ЛыткинАМ // Новая ХМ_РассчитатьДокументы() // №296
	// ХМНПФ 23.03.2016 ЛыткинАМ // РассчитатьДокументы() // №296
	// ХМНПФ 23.03.2016 ЛыткинАМ // ЗагрузитьРасторжениеВПФР() // №296
	// ХМНПФ 23.03.2016 ЛыткинАМ // ЗагрузитьРасторжениеВНПФ() // №296
	// ХМНПФ 28.03.2016 ШадринАВ // РассчитатьДокументы() // №296
	// ХМНПФ 05.04.2016 ЛыткинАМ // ЗагрузитьРасторжениеВПФР() // №296
	// ХМНПФ 05.04.2016 ЛыткинАМ // ЗагрузитьРасторжениеВНПФ() // №296
	// ХМНПФ 05.04.2016 ЛыткинАМ // Новая ХМ_ПолучитьПодходящийПоСостояниюДоговор() // №296
	// ХМНПФ 27.05.2016 ШадринАВ // ЗагрузитьВзносы() // №361
	// ХМНПФ 27.05.2016 ШадринАВ // ПрочитатьРазобратьЗапрос() // №361
	// ХМНПФ 20.07.2016 ШадринАВ // РассчитатьДокументы() // №436
КонецПроцедуры


&ИзменениеИКонтроль("ЗагрузитьВзносы")
Процедура ХМЗагрузитьВзносы(ФайлЗапроса, Протокол, ИмяФайла)

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СНИЛС", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(14)));
	ТЗ.Колонки.Добавить("Нпп", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(6,0)));
	ТЗ.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(25)));
	ТЗ.Колонки.Добавить("ДатаЗаключения", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("МестоРождения", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(350)));
	ТЗ.Колонки.Добавить("Пол", Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
	ТЗ.Колонки.Добавить("ВзносыСтрах", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ИДВзносыСтрах", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ВзносыДСВ", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ИДВзносыДСВ", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ВзносыРаботодателя", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ИДВзносыРаботодателя", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ВзносыСОФН", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ИДВзносыСОФН", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("МСК", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));
	ТЗ.Колонки.Добавить("ИДМСК", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(17,2)));


	Root = уп_ОПС.CreateDOMDocument(); 
	Root.Load(ФайлЗапроса.ПолноеИмя);
	Nodes = Root.getElementsByTagName("СведенияОСПНиДоговоре");
	Всего = Nodes.length;

	Если Всего = 0 Тогда
		Nodes = Root.getElementsByTagName("СведенияОДСВ");
		Всего = Nodes.length;
	КонецЕсли;	

	Если Всего = 0 Тогда
		Nodes = Root.getElementsByTagName("СведенияОСПНпоТому");
		Всего = Nodes.length;
	КонецЕсли;	

	#Вставка		
	// +ХМНПФ 27.05.2016 ШадринАВ // ЗагрузитьВзносы() // №361
	Если Всего = 0 Тогда
		ХМ_ЗагрузкаВыгрузкаЭДОсПФР.ПрочитатьФайлПоступленийОтПФР_ХМЛ(ТЗ, Root);
	КонецЕсли;	
	// -ХМНПФ 27.05.2016 ШадринАВ // ЗагрузитьВзносы() // №361
	#КонецВставки
	для Н = 1 по Всего цикл 
		#Если Клиент Тогда
			Состояние("Загрузка строки "+Н+" из "+Всего);
		#КонецЕсли
		Node = Nodes.item(Н-1);
		NodeFIO = Node.getElementsByTagName("ФИО").item(0); 
		NodeDOG = Node.getElementsByTagName("Договор").item(0); 
		NodePB = Node.getElementsByTagName("МестоРождения").item(0); 
		Стр = ТЗ.Добавить();

		СНИЛС_1 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СтраховойНомер");
		Если СтрДлина(СНИЛС_1) = 14 Тогда //это полный СНИЛС 
			Стр.СНИЛС = СНИЛС_1;
		Иначе	
			СНИЛС_2 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"КонтрольноеЧисло");
			Стр.СНИЛС = СобратьСНИЛС(СНИЛС_1,СНИЛС_2);
		КонецЕсли;
		Стр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"НомерПП");
		Стр.Фамилия = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Фамилия");
		Стр.Имя = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Имя");
		Стр.Отчество = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Отчество");
		ДатаРожд = уп_ОПС.ЗначениеУникальногоКлюча(Node,"ДатаРождения");
		Если ЗначениеЗаполнено(ДатаРожд) Тогда
			Стр.ДатаРождения = Дата(Прав(СокрЛП(ДатаРожд),4),Сред(СокрЛП(ДатаРожд),4,2), Лев(СокрЛП(ДатаРожд),2),00,00,00);
		КонецЕсли;

		ТипМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"ТипМестаРождения");
		ГородМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"ГородРождения");
		РайонМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"РайонРождения");
		РегионМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"РегионРождения");
		СтранаМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"СтранаРождения");
		Стр.МестоРождения = ?(ТипМР="СТАНДАРТНОЕ","0","1")+","+ГородМР+","+РайонМР+","+РегионМР+","+СтранаМР;

		Пол = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Пол");
		Стр.Пол = ?(ВРЕГ(Пол) = "М",Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский);
		Стр.НомерДоговора = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"Номер");
		ДатаЗакл = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"ДатаЗаключения");
		Стр.ДатаЗаключения = Дата(Прав(СокрЛП(ДатаЗакл),4),Сред(СокрЛП(ДатаЗакл),4,2), Лев(СокрЛП(ДатаЗакл),2),00,00,00);
		Попытка
			Стр.ВзносыСтрах = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"СуммаОПС"));
		Исключение
			Стр.ВзносыСтрах = 0;
		КонецПопытки;
		Попытка
			Стр.ИДВзносыСтрах = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИДОПС"));
		Исключение
			Попытка
				Стр.ИДВзносыСтрах = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИнвестДоходОПС"));
			Исключение
				Стр.ИДВзносыСтрах = 0;
			КонецПопытки;
		КонецПопытки;
		Попытка
			Стр.ВзносыДСВ = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"СуммаДСВ"));
		Исключение
			Стр.ВзносыДСВ = 0;
		КонецПопытки;
		Попытка
			Стр.ИДВзносыДСВ = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИДДСВ"));
		Исключение
			Попытка
				Стр.ИДВзносыДСВ = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИнвестДоходДСВ"));
			Исключение
				Стр.ИДВзносыДСВ = 0;
			КонецПопытки;
		КонецПопытки;
		Попытка
			Стр.ВзносыРаботодателя = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"СуммаРД"));
		Исключение
			Стр.ВзносыРаботодателя = 0;
		КонецПопытки;
		Попытка
			Стр.ИДВзносыРаботодателя = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИнвестДоходРД"));
		Исключение
			Стр.ИДВзносыРаботодателя = 0;
		КонецПопытки;
		Попытка
			Стр.ВзносыСОФН = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"СуммаСОФН"));
		Исключение
			Попытка
				Стр.ВзносыСОФН = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"СуммаСофин"));
			Исключение
				Стр.ВзносыСОФН = 0;
			КонецПопытки;
		Конецпопытки;
		Попытка
			Стр.ИДВзносыСОФН = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИДСОФН"));
		Исключение
			Попытка
				Стр.ИДВзносыСОФН = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИнвестДоходСофин"));
			Исключение
				Стр.ИДВзносыСОФН = 0;
			КонецПопытки;
		КонецПопытки;
		Попытка
			Стр.МСК = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"СуммаМСК"));
		Исключение
			Стр.МСК = 0;
		КонецПопытки;
		Попытка
			Стр.ИДМСК = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИДМСК"));
		Исключение
			Попытка
				Стр.ИДМСК = Число(уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИнвестДоходМСК"));
			Исключение
				Стр.ИДМСК = 0;
			КонецПопытки;
		КонецПопытки;
	конеццикла;

	//финансовый реестр
	Nodes_ = Root.getElementsByTagName("РЕЕСТР_ПЕРЕДАЧИ_СПН_ПФР_В_НПФ");
	Если Nodes_.length>0 Тогда
		Node_ = Nodes_.item(0);
		НомерДокРегистрации = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"НомерДокумента");
		ДатаДокРегистрации = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"ДатаДокумента");
		Если НЕ ЗначениеЗаполнено(ДатаДокРегистрации) Тогда
			ДатаДокРегистрации = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"ДатаФормированияДокумента");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДатаДокРегистрации) Тогда
			ДатаДокРегистрации = ДатаФормированияДокументов;
		КонецЕсли;	
		ДатаДокРегистрации = ПреобразоватьВДату(ДатаДокРегистрации);
		ДатаГод = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"Год");
		ДатаКвартал = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"Год");
		ДатаВКвартале = "01.0"+ДатаКвартал*3+"."+ДатаГод;
		ДатаВКвартале = ПреобразоватьВДату(ДатаВКвартале);
		Дата1 = НачалоКвартала(ДатаВКвартале);
		Дата2 = КонецКвартала(ДатаВКвартале);
	Иначе
		Nodes_ = Root.getElementsByTagName("РЕЕСТР_ПЕРЕДАЧИ_СУММ_ДСВ");
		Если Nodes_.length>0 Тогда
			Node_ = Nodes_.item(0);
			НомерДокРегистрации = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"НомерДокумента");
			ДатаДокРегистрации = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"ДатаДокумента");
			ДатаДокРегистрации = ПреобразоватьВДату(ДатаДокРегистрации);
			ДатаГод = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"Год");
			ДатаКвартал = уп_ОПС.ЗначениеУникальногоКлюча(Node_,"Год");
			ДатаВКвартале = "01.0"+ДатаКвартал*3+"."+ДатаГод;
			ДатаВКвартале = ПреобразоватьВДату(ДатаВКвартале);
			Дата1 = НачалоКвартала(ДатаВКвартале);
			Дата2 = КонецКвартала(ДатаВКвартале);
		Иначе
			НомерДокРегистрации = "НЕТ";
			ДатаДокРегистрации = ДатаФормированияДокументов;
			Дата1 = '0001.01.01';
			Дата2 = '0001.01.01';
		КонецЕсли;
	КонецЕсли;
	ДатаФинансовогоРеестра = ДатаДокРегистрации;

	//ищем может уже есть
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ДокументРегистрации.Ссылка
	|ИЗ
	|	Документ.уп_ДокументРегистрации КАК уп_ДокументРегистрации
	|ГДЕ
	|	уп_ДокументРегистрации.Организация = &Организация
	|	И уп_ДокументРегистрации.Номер = &Номер
	|	И уп_ДокументРегистрации.Дата МЕЖДУ &Дата1 И &Дата2
	|	И уп_ДокументРегистрации.Вид = &Вид
	|	И уп_ДокументРегистрации.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Вид", Справочники.уп_ВидыДокументовРегистрации.ФинансовыйРеестр);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаДокРегистрации));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаДокРегистрации));
	Запрос.УстановитьПараметр("Номер", СокрЛП(НомерДокРегистрации));
	Запрос.УстановитьПараметр("Организация", Организация);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДокументРегистрации = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		//создаем
		ДокРегистрации = Документы.уп_ДокументРегистрации.СоздатьДокумент();
		ДокРегистрации.Организация = Организация;
		ДокРегистрации.Вид = Справочники.уп_ВидыДокументовРегистрации.ФинансовыйРеестр;
		ДокРегистрации.Номер = НомерДокРегистрации;
		ДокРегистрации.Дата = ДатаДокРегистрации;
		ДокРегистрации.Записать();
		ДокументРегистрации = ДокРегистрации.Ссылка;
	КонецЕсли;

	ПенсионныйФонд = Константы.уп_ПенсионныйФондРФ.Получить();
	Если ВедутсяНераспределенныеВзносы Тогда
		ТекДок = Документы.уп_ФинансовыйРеестр.СоздатьДокумент();
		ТекДок.Дата = ДатаФинансовогоРеестра;
	Иначе
		ТекДок = Документы.уп_РегистрацияПоступленийОПС.СоздатьДокумент();
		ТекДок.Дата = ДатаФормированияДокументов;
	Конецесли;
	ТекДок.Организация = Организация;
	ТекДок.ДатаФинансовогоРеестра = ДатаФинансовогоРеестра;
	ТекДок.ПенсионныйФонд = ПенсионныйФонд;

	ТекДок.Комментарий = ИмяФайла;
	ТекДок.Ответственный = Ответственный;
	ТекДок.ДатаНачалаПериодаВзносов = Дата1;
	ТекДок.ДатаКонцаПериодаВзносов = Дата2;
	ТекДок.Комментарий = ИмяФайла;

	Если КорректироватьДанныеЗЛ Тогда
		ДокКорректировки = Документы.уп_КорректировкаДанныхЗЛПоРеестрам.СоздатьДокумент();
		ДокКорректировки.Дата = ДатаФормированияДокументов;
		ДокКорректировки.Комментарий = ИмяФайла;
		ДокКорректировки.Организация = Организация;
		ДокКорректировки.Ответственный = Ответственный;
		ДокКорректировки.ФинансовыйРеестр = ДокРегистрации;
	Иначе
		ДокКорректировки = Неопределено;
	КонецЕсли;

	ТабЗакрытых = Новый ТаблицаЗначений;
	ТабЗакрытых.Колонки.Добавить("ДоговорОПС");
	ТабЗакрытых.Колонки.Добавить("Участник");
	ТабЗакрытых.Колонки.Добавить("ТипСуммы");
	ТабЗакрытых.Колонки.Добавить("Сумма");

	#Вставка		
	// +ХМНПФ 27.05.2016 ШадринАВ // ЗагрузитьВзносы() // №361
	ТабЗакрытых = ТекДок.ДоговорыОПС;
	// -ХМНПФ 27.05.2016 ШадринАВ // ЗагрузитьВзносы() // №361
    #КонецВставки		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабДляЗагрузки.СНИЛС,
	|	ТабДляЗагрузки.НомерДоговора,
	|	ТабДляЗагрузки.ДатаЗаключения,
	|	ТабДляЗагрузки.Фамилия,
	|	ТабДляЗагрузки.Имя,
	|	ТабДляЗагрузки.Отчество,
	|	ТабДляЗагрузки.ДатаРождения,
	|	ТабДляЗагрузки.МестоРождения,
	|	ТабДляЗагрузки.ВзносыСтрах,
	|	ТабДляЗагрузки.ИДВзносыСтрах,
	|	ТабДляЗагрузки.ВзносыДСВ,
	|	ТабДляЗагрузки.ИДВзносыДСВ,
	|	ТабДляЗагрузки.ВзносыРаботодателя,
	|	ТабДляЗагрузки.ИДВзносыРаботодателя,
	|	ТабДляЗагрузки.ВзносыСОФН,
	|	ТабДляЗагрузки.ИДВзносыСОФН,
	|	ТабДляЗагрузки.МСК,
	|	ТабДляЗагрузки.ИДМСК,
	|	ТабДляЗагрузки.Нпп
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ТабДляЗагрузки КАК ТабДляЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходныеДанные.СНИЛС,
	|	ИсходныеДанные.НомерДоговора,
	|	ИсходныеДанные.ДатаЗаключения,
	|	ИсходныеДанные.Фамилия,
	|	ИсходныеДанные.Имя,
	|	ИсходныеДанные.Отчество,
	|	ИсходныеДанные.ВзносыСтрах,
	|	ИсходныеДанные.ИДВзносыСтрах,
	|	ИсходныеДанные.ВзносыДСВ,
	|	ИсходныеДанные.ИДВзносыДСВ,
	|	ИсходныеДанные.ВзносыРаботодателя,
	|	ИсходныеДанные.ИДВзносыРаботодателя,
	|	ИсходныеДанные.ВзносыСОФН,
	|	ИсходныеДанные.ИДВзносыСОФН,
	|	ИсходныеДанные.МСК,
	|	ИсходныеДанные.ИДМСК,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник КАК ЗЛ,
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
	|	ИсходныеДанные.Нпп КАК Нпп,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК ФамилияРегистр,
	|	ФИОФизЛицСрезПоследних.Имя КАК ИмяРегистр,
	|	ФИОФизЛицСрезПоследних.Отчество КАК ОтчествоРегистр,
	|	ИсходныеДанные.ДатаРождения,
	|	ИсходныеДанные.МестоРождения,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРожденияБаза,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.МестоРождения КАК МестоРожденияБаза
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_СостоянияДоговораОПССрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДок, ) КАК ФИОФизЛицСрезПоследних
	|			ПО уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо = ФИОФизЛицСрезПоследних.ФизическоеЛицо
	|		ПО ИсходныеДанные.СНИЛС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
	|			И ИсходныеДанные.НомерДоговора = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Код
	|			И (НАЧАЛОПЕРИОДА(ИсходныеДанные.ДатаЗаключения, ДЕНЬ) = НАЧАЛОПЕРИОДА(уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДатаЗаключения, ДЕНЬ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Нпп";

	Запрос.УстановитьПараметр("ДатаДок", КонецДня(ДатаФормированияДокументов));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТабДляЗагрузки", ТЗ);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Всего = ВыборкаДетальныеЗаписи.Количество();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		#Если Клиент Тогда
			Состояние("Обработка строки "+ВыборкаДетальныеЗаписи.Нпп+" из "+Всего);
		#КонецЕсли
		//Если ВыборкаДетальныеЗаписи.ЗЛ = NULL Тогда //не найден контрагент
		//	Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаДетальныеЗаписи.СНИЛС);
		Если ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
			ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
			Протокол.ДобавитьСтроку("Не найден договор об ОПС №"+ВыборкаДетальныеЗаписи.НомерДоговора+" от "+ВыборкаДетальныеЗаписи.ДатаЗаключения+" с "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
		Иначе //все в порядке
			Если ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
				и ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПоступленияВзносов
				и ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод Тогда
				Протокол.ДобавитьСтроку("Обратите внимание!! Состояние договора №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" = "+ВыборкаДетальныеЗаписи.Состояние);
			КонецЕсли;
			Если КорректироватьДанныеЗЛ Тогда
				ИзмененоФИО = Ложь;
				ИзмененоДР = Ложь;
				ИзмененоМР = Ложь;
				//проверим дату рождения
				Если НачалоДня(ВыборкаДетальныеЗаписи.ДатаРождения)<>НачалоДня(ВыборкаДетальныеЗаписи.ДатаРожденияБаза) Тогда
					ИзмененоДР = Истина;
				КонецЕсли;
				//проверим место рождения
				Если ВРЕГ(СокрЛП(ВыборкаДетальныеЗаписи.МестоРожденияБаза))<>ВРЕГ(СокрЛП(ВыборкаДетальныеЗаписи.МестоРождения)) Тогда
					ИзмененоМР = Истина;
				КонецЕсли;	
				//проверим ФИО
				Если СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Фамилия))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ФамилияРегистр))
					ИЛИ СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Имя))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ИмяРегистр))
					ИЛИ СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Отчество))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ОтчествоРегистр)) Тогда
					ИзмененоФИО = Истина;
					Протокол.ДобавитьСтроку("Обратите внимание!! У физ. лица со СНИЛС "+ВыборкаДетальныеЗаписи.СНИЛС+" ФИО в реестре "+ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество+" <> ФИО в базе данных "+ВыборкаДетальныеЗаписи.ФамилияРегистр+" "+ВыборкаДетальныеЗаписи.ИмяРегистр+" "+ВыборкаДетальныеЗаписи.ОтчествоРегистр);
				КонецЕсли;

				Если (ИзмененоФИО ИЛИ ИзмененоДР ИЛИ ИзмененоМР) Тогда
					НовСтрКорректировки = ДокКорректировки.ЗастрахованныеЛица.Добавить();
					НовСтрКорректировки.Корректировать = Истина;
					НовСтрКорректировки.ЗЛ = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
					НовСтрКорректировки.ИзмененоФИО = ИзмененоФИО;
					НовСтрКорректировки.ФИОПоБазе = СокрЛП(ВыборкаДетальныеЗаписи.ФамилияРегистр)+" "+СокрЛП(ВыборкаДетальныеЗаписи.ИмяРегистр)+" "+СокрЛП(ВыборкаДетальныеЗаписи.ОтчествоРегистр);
					НовСтрКорректировки.ФИОПоРеестру = СокрЛП(ВыборкаДетальныеЗаписи.Фамилия)+" "+СокрЛП(ВыборкаДетальныеЗаписи.Имя)+" "+СокрЛП(ВыборкаДетальныеЗаписи.Отчество);
					НовСтрКорректировки.ИзмененаДР = ИзмененоДР;
					НовСтрКорректировки.ДРПоБазе = ВыборкаДетальныеЗаписи.ДатаРожденияБаза;
					НовСтрКорректировки.ДРПоРеестру = ВыборкаДетальныеЗаписи.ДатаРождения;
					НовСтрКорректировки.ИзмененоМестоРождения = ИзмененоМР;
					НовСтрКорректировки.МРПоБазе = ВыборкаДетальныеЗаписи.МестоРожденияБаза;
					НовСтрКорректировки.МРПоРеестру = ВыборкаДетальныеЗаписи.МестоРождения;
				КонецЕсли;	
			Конецесли;
			Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
				Если ВыборкаДетальныеЗаписи.ВзносыСтрах<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ВзносыФиз, ВыборкаДетальныеЗаписи.ВзносыСтрах);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ИДВзносыСтрах<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДФиз, ВыборкаДетальныеЗаписи.ИДВзносыСтрах);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ВзносыДСВ<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ДопВзносы,ВыборкаДетальныеЗаписи.ВзносыДСВ);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ИДВзносыДСВ<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДДопВзносы, ВыборкаДетальныеЗаписи.ИДВзносыДСВ);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ВзносыРаботодателя<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ВзносыЮр, ВыборкаДетальныеЗаписи.ВзносыРаботодателя);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ИДВзносыРаботодателя<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДЮр, ВыборкаДетальныеЗаписи.ИДВзносыРаботодателя);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ВзносыСОФН<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ГосПоддержка, ВыборкаДетальныеЗаписи.ВзносыСОФН);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ИДВзносыСОФН<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДГосПоддержка, ВыборкаДетальныеЗаписи.ИДВзносыСОФН);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.МСК<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.МатКапитал, ВыборкаДетальныеЗаписи.МСК);
				КонецЕсли;
				Если ВыборкаДетальныеЗаписи.ИДМСК<>0 Тогда
					ДобавитьСтроку(ТабЗакрытых, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДМатКапитал, ВыборкаДетальныеЗаписи.ИДМСК);
				КонецЕсли;
			Иначе
				//если сумма нулевая, то добавляем одну строку
				Если ВыборкаДетальныеЗаписи.ВзносыСтрах = 0 И ВыборкаДетальныеЗаписи.ИДВзносыСтрах = 0
					И ВыборкаДетальныеЗаписи.ВзносыДСВ = 0 И ВыборкаДетальныеЗаписи.ИДВзносыДСВ = 0
					И ВыборкаДетальныеЗаписи.ВзносыРаботодателя = 0 И ВыборкаДетальныеЗаписи.ИДВзносыРаботодателя = 0
					И ВыборкаДетальныеЗаписи.ВзносыСОФН = 0 И ВыборкаДетальныеЗаписи.ИДВзносыСОФН = 0
					И ВыборкаДетальныеЗаписи.МСК = 0 И ВыборкаДетальныеЗаписи.ИДМСК = 0 Тогда
					ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ВзносыФиз, ВыборкаДетальныеЗаписи.ВзносыСтрах);
				Иначе
					Если ВыборкаДетальныеЗаписи.ВзносыСтрах<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ВзносыФиз, ВыборкаДетальныеЗаписи.ВзносыСтрах);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ИДВзносыСтрах<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДФиз, ВыборкаДетальныеЗаписи.ИДВзносыСтрах);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ВзносыДСВ<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ДопВзносы, ВыборкаДетальныеЗаписи.ВзносыДСВ);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ИДВзносыДСВ<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДДопВзносы, ВыборкаДетальныеЗаписи.ИДВзносыДСВ);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ВзносыРаботодателя<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ВзносыЮр, ВыборкаДетальныеЗаписи.ВзносыРаботодателя);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ИДВзносыРаботодателя<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДЮр, ВыборкаДетальныеЗаписи.ИДВзносыРаботодателя);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ВзносыСОФН<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ГосПоддержка, ВыборкаДетальныеЗаписи.ВзносыСОФН);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ИДВзносыСОФН<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДГосПоддержка, ВыборкаДетальныеЗаписи.ИДВзносыСОФН);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.МСК<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.МатКапитал, ВыборкаДетальныеЗаписи.МСК);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.ИДМСК<>0 Тогда
						ДобавитьСтроку(ТекДок.ДоговорыОПС, ВыборкаДетальныеЗаписи.ДоговорОПС, Справочники.уп_ТипыСуммОПС.ИДМатКапитал, ВыборкаДетальныеЗаписи.ИДМСК);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;

	Если ТекДок.ДоговорыОПС.Количество()>0 Тогда
		ТекДок.Записать();
		Протокол.ДобавитьСтроку("Записан документ "+ТекДок);

		НовСтрНачислений = НовыеНачисления.Добавить();
		НовСтрНачислений.Документ = ТекДок.Ссылка;
		НовСтрНачислений.Комментарий = ТекДок.Комментарий;
	КонецЕсли;	

	#Удаление 
	Если ТабЗакрытых.Количество()>0 Тогда
	#КонецУдаления
	#Вставка 
	// +ХМНПФ 27.05.2016 ШадринАВ // ЗагрузитьВзносы() // №361
	Если Ложь Тогда
	// -ХМНПФ 27.05.2016 ШадринАВ // ЗагрузитьВзносы() // №361		
	#КонецВставки
		Если ВедутсяНераспределенныеВзносы Тогда
			Док = Документы.уп_ФинансовыйРеестр.СоздатьДокумент();
			Док.Дата = ДатаФинансовогоРеестра;
		Иначе
			Док = Документы.уп_РегистрацияПоступленийОПС.СоздатьДокумент();
			Док.Дата = ДатаФормированияДокументов;
		Конецесли;
		Док = Документы.уп_РегистрацияПоступленийОПС.СоздатьДокумент();
		Док.Организация = Организация;
		Док.ДатаФинансовогоРеестра = ДатаФинансовогоРеестра;
		Док.ПенсионныйФонд = ПенсионныйФонд;
		Док.Ответственный = Ответственный;
		Док.ДатаНачалаПериодаВзносов = Дата1;
		Док.ДатаКонцаПериодаВзносов = Дата2;
		Док.Комментарий = "Закрытые по "+ИмяФайла;
		Для каждого стр из ТабЗакрытых Цикл
			ДобавитьСтроку(Док.ДоговорыОПС, стр.ДоговорОПС, стр.ТипСуммы, стр.Сумма);
		КонецЦикла;	
		Док.Записать();
		Протокол.ДобавитьСтроку("Взносы по закрытым договорам ОПС загружены в документ "+Док);

		НовСтрНачислений = НовыеНачисления.Добавить();
		НовСтрНачислений.Документ = Док.Ссылка;
		НовСтрНачислений.Комментарий = Док.Комментарий;
	КонецЕсли;	
	Если КорректироватьДанныеЗЛ Тогда
		Если ДокКорректировки.ЗастрахованныеЛица.Количество()>0 Тогда
			ДокКорректировки.Записать();
			Протокол.ДобавитьСтроку("Записан документ "+ДокКорректировки);

			НовСтрНачислений = НовыеНачисления.Добавить();
			НовСтрНачислений.Документ = ДокКорректировки.Ссылка;
			НовСтрНачислений.Комментарий = ДокКорректировки.Комментарий;
		КонецЕсли;	
	КонецЕсли;

	Если ТекДок.ДоговорыОПС.Количество()>0 или ТабЗакрытых.Количество()>0 или (КорректироватьДанныеЗЛ И ДокКорректировки.ЗастрахованныеЛица.Количество()>0) Тогда
		Протокол.Добавитьстроку("Файл загружен.");

		СтрФайлов = ЗагруженныеФайлы.Добавить();
		СтрФайлов.ИмяФайла = ИмяФайла;
	Иначе
		Протокол.ДобавитьСтроку("Файл не загружен в связи с отсутствием строк в документе.");
	КонецЕсли;	

КонецПроцедуры


&ИзменениеИКонтроль("ЗагрузитьПодтверждениеИзНПФ")
Процедура ХМЗагрузитьПодтверждениеИзНПФ(ФайлЗапроса, Протокол, ИмяФайла)

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СНИЛС", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(14)));
	ТЗ.Колонки.Добавить("Нпп", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(6,0)));
	ТЗ.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("МестоРождения", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(350)));
	ТЗ.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(25)));
	ТЗ.Колонки.Добавить("ДатаЗаключения", Новый ОписаниеТипов("Дата"));

	Root = уп_ОПС.CreateDOMDocument(); 
	Root.Load(ФайлЗапроса.ПолноеИмя);

	Nodes_ = Root.getElementsByTagName("ПредыдущийСтраховщик");
	Для J = 0 по Nodes_.length - 1 Цикл
		Node_ = Nodes_.item(J);
		ИНН = ""; 
		для N = 0 по Node_.ChildNodes.length-1 Цикл
			Node = Node_.ChildNodes(N);
			//Сообщить("Имя "+Node.nodeName);
			Если Node.nodeName = СокрЛП("ПредыдущийНПФ") Тогда 
				Наименование = уп_ОПС.ЗначениеУникальногоКлюча(Node,"Наименование");
				//фиксируем номер ИНН
				ИНН = уп_ОПС.ЗначениеУникальногоКлюча(Node,"ИНН");
				//Сообщить("ИНН "+ИНН);
				НПФ = НайтиФондПоРеквизитам(ИНН, Наименование);
			КонецЕсли;
			Если Node.nodeName = СокрЛП("СведенияОЗЛиДоговоре") Тогда 
				NodeFIO = Node.getElementsByTagName("ФИО").item(0);
				NodeDOG = Node.getElementsByTagName("Договор").item(0);
				Попытка
					NodePB = Node.getElementsByTagName("МестоРождения").item(0);
				Исключение
				КонецПопытки;
				//Сообщить("СНИЛС "+ЗначениеУникальногоКлюча(Node,"СНИЛС"));
				НовСтр = ТЗ.Добавить();
				НовСтр.Контрагент = НПФ;
				//bardoshina +
				//НовСтр.СНИЛС = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СтраховойНомер");
				//НовСтр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"НомерПП");
				СНИЛС1 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СтраховойНомер");
				Если СтрДлина(СНИЛС1)<9 Тогда
					СНИЛС1 = ДобавитьДоФормата(СНИЛС1,9,"0","Лево");
				КонецЕсли;
				СНИЛС2 = ПолучитьКонтрольноеЧисло(СНИЛС1);
				Если СтрДлина(СНИЛС2)<2 Тогда
					СНИЛС2 = ДобавитьДоФормата(СНИЛС2,2,"0","Лево");
				КонецЕсли;
				СНИЛС = Лев(СНИЛС1,3)+"-"+Сред(СНИЛС1,4,3)+"-"+Прав(СНИЛС1,3)+" "+СНИЛС2;
				НовСтр.СНИЛС = СНИЛС;
				НовСтр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"ПорядковыйНомер");
				//bardoshina -
				НовСтр.Фамилия = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Фамилия");
				НовСтр.Имя = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Имя");
				НовСтр.Отчество = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Отчество");
				ДатаРожд = уп_ОПС.ЗначениеУникальногоКлюча(Node,"ДатаРождения");
				Если ЗначениеЗаполнено(ДатаРожд) Тогда
					НовСтр.ДатаРождения = Дата(Прав(СокрЛП(ДатаРожд),4),Сред(СокрЛП(ДатаРожд),4,2), Лев(СокрЛП(ДатаРожд),2),00,00,00);
				КонецЕсли;
				Попытка
					ТипМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"ТипМестаРождения");
					ГородМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"ГородРождения");
					РайонМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"РайонРождения");
					РегионМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"РегионРождения");
					СтранаМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"СтранаРождения");
					НовСтр.МестоРождения = ?(ТипМР="СТАНДАРТНОЕ","0","1")+","+ГородМР+","+РайонМР+","+РегионМР+","+СтранаМР;
				Исключение
				КонецПопытки;
				НовСтр.НомерДоговора = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"Номер");
				ДатаЗакл = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"ДатаЗаключения");
				НовСтр.ДатаЗаключения = Дата(Прав(СокрЛП(ДатаЗакл),4),Сред(СокрЛП(ДатаЗакл),4,2), Лев(СокрЛП(ДатаЗакл),2),00,00,00);
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;

	//создаем документ
	НовыйДокумент = Документы.уп_ПодтверждениеПФР.СоздатьДокумент();
	НовыйДокумент.Дата = ДатаФормированияДокументов;
	НовыйДокумент.Организация = Организация;
	НовыйДокумент.Комментарий = ИмяФайла;
	НовыйДокумент.Ответственный = Ответственный;

	Если КорректироватьДанныеЗЛ Тогда
		ДокКорректировки = Документы.уп_КорректировкаДанныхЗЛПоРеестрам.СоздатьДокумент();
		ДокКорректировки.Дата = ДатаФормированияДокументов;
		ДокКорректировки.Организация = Организация;
		ДокКорректировки.Ответственный = Ответственный;
		//ДокКорректировки.ФинансовыйРеестр = ФинансовыйРеестр;
		ДокКорректировки.Комментарий = ИмяФайла;
	Иначе
		ДокКорректировки = Неопределено;
	КонецЕсли;


	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабДляЗагрузки.СНИЛС,
	|	ТабДляЗагрузки.НомерДоговора,
	|	ТабДляЗагрузки.ДатаЗаключения,
	|	ТабДляЗагрузки.Фамилия,
	|	ТабДляЗагрузки.Имя,
	|	ТабДляЗагрузки.Отчество,
	|	ТабДляЗагрузки.Контрагент,
	|	ТабДляЗагрузки.Нпп
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ТабДляЗагрузки КАК ТабДляЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ДоговорыОПС.Ссылка КАК ДоговорОПС,
	|	ИсходныеДанные.СНИЛС,
	|	ИсходныеДанные.НомерДоговора,
	|	ИсходныеДанные.ДатаЗаключения,
	|	ИсходныеДанные.Фамилия,
	|	ИсходныеДанные.Имя,
	|	ИсходныеДанные.Отчество,
	|	ИсходныеДанные.Контрагент,
	|	ИсходныеДанные.Нпп
	|ПОМЕСТИТЬ ДоговорыОПС
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уп_ДоговорыОПС КАК уп_ДоговорыОПС
	|		ПО ИсходныеДанные.СНИЛС = уп_ДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
	|			И (НАЧАЛОПЕРИОДА(ИсходныеДанные.ДатаЗаключения, ДЕНЬ) = НАЧАЛОПЕРИОДА(уп_ДоговорыОПС.ДатаЗаключения, ДЕНЬ))
	|			И ИсходныеДанные.НомерДоговора = уп_ДоговорыОПС.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыОПС.СНИЛС,
	|	ДоговорыОПС.НомерДоговора,
	|	ДоговорыОПС.ДатаЗаключения,
	|	ДоговорыОПС.Фамилия,
	|	ДоговорыОПС.Имя,
	|	ДоговорыОПС.Отчество,
	|	ДоговорыОПС.Контрагент,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") КАК ФамилияРегистр,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """") КАК ИмяРегистр,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Отчество, """") КАК ОтчествоРегистр, 
	#Удаление 
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник КАК ЗЛ,
	#КонецУдаления
	#Вставка		
	// +ХМНПФ 22.03.2016 ЛыткинАМ // ЗагрузитьПодтверждениеИзНПФ() // №286
	|	ДоговорыОПС.ДоговорОПС,
	|	ДоговорыОПС.ДоговорОПС.Участник КАК ЗЛ,
	// -ХМНПФ 22.03.2016 ЛыткинАМ // ЗагрузитьПодтверждениеИзНПФ() // №286
	#КонецВставки
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРожденияБаза,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.МестоРождения КАК МестоРожденияБаза,
	|	ДоговорыОПС.Нпп КАК Нпп
	|ИЗ
	|	ДоговорыОПС КАК ДоговорыОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
	|				&ДатаДок,
	|				ДоговорОПС.Организация = &Организация
	|					И ДоговорОПС В
	|						(ВЫБРАТЬ
	|							ДоговорыОПС.ДоговорОПС
	|						ИЗ
	|							ДоговорыОПС КАК ДоговорыОПС)) КАК уп_СостоянияДоговораОПССрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДок, ) КАК ФИОФизЛицСрезПоследних
	|			ПО уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо = ФИОФизЛицСрезПоследних.ФизическоеЛицо
	|		ПО ДоговорыОПС.ДоговорОПС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Нпп";

	Запрос.УстановитьПараметр("ДатаДок", ДатаФормированияДокументов);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТабДляЗагрузки", ТЗ);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Всего = ВыборкаДетальныеЗаписи.Количество();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		#Если Клиент Тогда
			Состояние("Обработка строки "+ВыборкаДетальныеЗаписи.Нпп+" из "+Всего);
		#КонецЕсли
		Если ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
			ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
			Протокол.ДобавитьСтроку("Не найден договор об ОПС №"+ВыборкаДетальныеЗаписи.НомерДоговора+" от "+ВыборкаДетальныеЗаписи.ДатаЗаключения+" с "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
		ИначеЕсли ВыборкаДетальныеЗаписи.ЗЛ = NULL Тогда //не найден контрагент
			Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаДетальныеЗаписи.СНИЛС);
		ИначеЕсли ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
			ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
			Протокол.ДобавитьСтроку("Не найден договор об ОПС №"+ВыборкаДетальныеЗаписи.НомерДоговора+" от "+ВыборкаДетальныеЗаписи.ДатаЗаключения+" с "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
		Иначе //все в порядке
			Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
				Протокол.ДобавитьСтроку("Договор №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" уже закрыт и не будет внесен в табличную часть!");
				Продолжить;
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
				и ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.Заключен  Тогда
				Протокол.ДобавитьСтроку("Обратите внимание!! Состояние договора №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" = "+ВыборкаДетальныеЗаписи.Состояние);
				Продолжить;
			КонецЕсли;
			НовСтр = НовыйДокумент.ДоговорыОПС.Добавить();
			НовСтр.ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
			НовСтр.Участник = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
			НовСтр.ПредыдущийСтраховщик = ВыборкаДетальныеЗаписи.Контрагент;

			Если КорректироватьДанныеЗЛ Тогда
				ИзмененоФИО = Ложь;
				ИзмененоДР = Ложь;
				ИзмененоМР = Ложь;
				//проверим дату рождения
				Если НачалоДня(ВыборкаДетальныеЗаписи.ДатаРождения)<>НачалоДня(ВыборкаДетальныеЗаписи.ДатаРожденияБаза) Тогда
					ИзмененоДР = Истина;
				КонецЕсли;
				//проверим место рождения
				Если ЗначениеЗаполнено(СокрЛП(ВыборкаДетальныеЗаписи.МестоРождения)) Тогда
					Если ВРЕГ(СокрЛП(ВыборкаДетальныеЗаписи.МестоРожденияБаза))<>ВРЕГ(СокрЛП(ВыборкаДетальныеЗаписи.МестоРождения)) Тогда
						ИзмененоМР = Истина;
					КонецЕсли;
				КонецЕсли;
				//проверим ФИО
				Если СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Фамилия))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ФамилияРегистр))
					ИЛИ СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Имя))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ИмяРегистр))
					ИЛИ СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Отчество))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ОтчествоРегистр)) Тогда
					ИзмененоФИО = Истина;
					Протокол.ДобавитьСтроку("Обратите внимание!! У физ. лица со СНИЛС "+ВыборкаДетальныеЗаписи.СНИЛС+" ФИО в реестре "+ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество+" <> ФИО в базе данных "+ВыборкаДетальныеЗаписи.ФамилияРегистр+" "+ВыборкаДетальныеЗаписи.ИмяРегистр+" "+ВыборкаДетальныеЗаписи.ОтчествоРегистр);
				КонецЕсли;	

				Если (ИзмененоФИО ИЛИ ИзмененоДР ИЛИ ИзмененоМР) И КорректироватьДанныеЗЛ Тогда
					НовСтрКорректировки = ДокКорректировки.ЗастрахованныеЛица.Добавить();
					НовСтрКорректировки.Корректировать = Истина;
					НовСтрКорректировки.ЗЛ = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
					НовСтрКорректировки.ИзмененоФИО = ИзмененоФИО;
					НовСтрКорректировки.ФИОПоБазе = СокрЛП(ВыборкаДетальныеЗаписи.ФамилияРегистр)+" "+СокрЛП(ВыборкаДетальныеЗаписи.ИмяРегистр)+" "+СокрЛП(ВыборкаДетальныеЗаписи.ОтчествоРегистр);
					НовСтрКорректировки.ФИОПоРеестру = СокрЛП(ВыборкаДетальныеЗаписи.Фамилия)+" "+СокрЛП(ВыборкаДетальныеЗаписи.Имя)+" "+СокрЛП(ВыборкаДетальныеЗаписи.Отчество);
					НовСтрКорректировки.ИзмененаДР = ИзмененоДР;
					НовСтрКорректировки.ДРПоБазе = ВыборкаДетальныеЗаписи.ДатаРожденияБаза;
					НовСтрКорректировки.ДРПоРеестру = ВыборкаДетальныеЗаписи.ДатаРождения;
					НовСтрКорректировки.ИзмененоМестоРождения = ИзмененоМР;
					НовСтрКорректировки.МРПоБазе = ВыборкаДетальныеЗаписи.МестоРожденияБаза;
					НовСтрКорректировки.МРПоРеестру = ВыборкаДетальныеЗаписи.МестоРождения;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;

	Если НовыйДокумент.ДоговорыОПС.Количество() > 0 Тогда
		НовыйДокумент.Записать();
		НовоеНачисление = НовыеНачисления.Добавить();
		НовоеНачисление.Документ = НовыйДокумент.Ссылка;
		НовоеНачисление.Комментарий = НовыйДокумент.Комментарий;
		Протокол.ДобавитьСтроку("Записан документ "+НовыйДокумент.Ссылка);
		Протокол.Добавитьстроку("Файл загружен.");

		СтрФайлов = ЗагруженныеФайлы.Добавить();
		СтрФайлов.ИмяФайла = ИмяФайла;

		Если КорректироватьДанныеЗЛ Тогда
			Если ДокКорректировки.ЗастрахованныеЛица.Количество()>0 Тогда
				ДокКорректировки.Записать();
				НовоеНачисление = НовыеНачисления.Добавить();
				НовоеНачисление.Документ = ДокКорректировки.Ссылка;
				НовоеНачисление.Комментарий = ДокКорректировки.Комментарий;
				Протокол.ДобавитьСтроку("Записан документ "+ДокКорректировки.Ссылка);
			КонецЕсли;	
		КонецЕсли;	
	Иначе
		Сообщить("Документ не создан, т.к. нет строк в табличной части (файл: " + ИмяФайла + " ).");
	КонецЕсли;
КонецПроцедуры


&ИзменениеИКонтроль("ЗагрузитьПодтверждениеИзПФР")
Процедура ХМЗагрузитьПодтверждениеИзПФР(ФайлЗапроса, Протокол, ИмяФайла)

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СНИЛС", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(14)));
	ТЗ.Колонки.Добавить("Нпп", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(6,0)));
	ТЗ.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("ДатаРождения", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("МестоРождения", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(350)));
	ТЗ.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(25)));
	ТЗ.Колонки.Добавить("ДатаЗаключения", Новый ОписаниеТипов("Дата"));

	Root = уп_ОПС.CreateDOMDocument(); 
	Root.Load(ФайлЗапроса.ПолноеИмя);

	Nodes_ = Root.getElementsByTagName("УходВНПФизПФР");
	Node_ = Nodes_.item(0);
	NodesZL = Node_.getElementsByTagName("СведенияОЗЛиДоговоре");
	Всего = NodesZL.length; 

	для Н=1 по Всего Цикл
		#Если Клиент Тогда
			Состояние("Загрузка строки "+Н+" из "+Всего);
		#КонецЕсли
		Node = NodesZL.item(Н-1);
		NodeFIO = Node.getElementsByTagName("ФИО").item(0);
		NodeDOG = Node.getElementsByTagName("Договор").item(0);
		Попытка
			NodePB = Node.getElementsByTagName("МестоРождения").item(0);
		Исключение
		КонецПопытки;
		//Сообщить("СНИЛС "+ЗначениеУникальногоКлюча(Node,"СНИЛС"));
		НовСтр = ТЗ.Добавить();
		НовСтр.Контрагент = Константы.уп_ПенсионныйФондРФ.Получить();
		//bardoshina +
		//НовСтр.СНИЛС = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СтраховойНомер");
		//НовСтр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"НомерПП");
		СНИЛС1 = уп_ОПС.ЗначениеУникальногоКлюча(Node,"СтраховойНомер");
		Если СтрДлина(СНИЛС1)<9 Тогда
			СНИЛС1 = ДобавитьДоФормата(СНИЛС1,9,"0","Лево");
		КонецЕсли;
		СНИЛС2 = ПолучитьКонтрольноеЧисло(СНИЛС1);
		Если СтрДлина(СНИЛС2)<2 Тогда
			СНИЛС2 = ДобавитьДоФормата(СНИЛС2,2,"0","Лево");
		КонецЕсли;
		СНИЛС = Лев(СНИЛС1,3)+"-"+Сред(СНИЛС1,4,3)+"-"+Прав(СНИЛС1,3)+" "+СНИЛС2;
		НовСтр.СНИЛС = СНИЛС;
		НовСтр.Нпп = уп_ОПС.ЗначениеУникальногоКлюча(Node,"ПорядковыйНомер");
		//bardoshina -
		НовСтр.Фамилия = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Фамилия");
		НовСтр.Имя = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Имя");
		НовСтр.Отчество = уп_ОПС.ЗначениеУникальногоКлюча(NodeFIO,"Отчество");
		ДатаРожд = уп_ОПС.ЗначениеУникальногоКлюча(Node,"ДатаРождения");
		Если ЗначениеЗаполнено(ДатаРожд) Тогда
			НовСтр.ДатаРождения = Дата(Прав(СокрЛП(ДатаРожд),4),Сред(СокрЛП(ДатаРожд),4,2), Лев(СокрЛП(ДатаРожд),2),00,00,00);
		КонецЕсли;
		Попытка
			ТипМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"ТипМестаРождения");
			ГородМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"ГородРождения");
			РайонМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"РайонРождения");
			РегионМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"РегионРождения");
			СтранаМР = уп_ОПС.ЗначениеУникальногоКлюча(NodePB,"СтранаРождения");
			НовСтр.МестоРождения = ?(ТипМР="СТАНДАРТНОЕ","0","1")+","+ГородМР+","+РайонМР+","+РегионМР+","+СтранаМР;
		Исключение
		КонецПопытки;
		НовСтр.НомерДоговора = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"Номер");
		ДатаЗакл = уп_ОПС.ЗначениеУникальногоКлюча(NodeDOG,"ДатаЗаключения");
		НовСтр.ДатаЗаключения = Дата(Прав(СокрЛП(ДатаЗакл),4),Сред(СокрЛП(ДатаЗакл),4,2), Лев(СокрЛП(ДатаЗакл),2),00,00,00);
	КонецЦикла;


	//создаем документ
	НовыйДокумент = Документы.уп_ПодтверждениеПФР.СоздатьДокумент();
	НовыйДокумент.Дата = ДатаФормированияДокументов;
	НовыйДокумент.Организация = Организация;
	НовыйДокумент.Комментарий = ИмяФайла;
	НовыйДокумент.Ответственный = Ответственный;

	Если КорректироватьДанныеЗЛ Тогда
		ДокКорректировки = Документы.уп_КорректировкаДанныхЗЛПоРеестрам.СоздатьДокумент();
		ДокКорректировки.Дата = ДатаФормированияДокументов;
		ДокКорректировки.Организация = Организация;
		ДокКорректировки.Ответственный = Ответственный;
		//ДокКорректировки.ФинансовыйРеестр = ФинансовыйРеестр;
		ДокКорректировки.Комментарий = ИмяФайла;
	Иначе
		ДокКорректировки = Неопределено;
	КонецЕсли;


	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабДляЗагрузки.СНИЛС,
	|	ТабДляЗагрузки.НомерДоговора,
	|	ТабДляЗагрузки.ДатаЗаключения,
	|	ТабДляЗагрузки.Фамилия,
	|	ТабДляЗагрузки.Имя,
	|	ТабДляЗагрузки.Отчество,
	|	ТабДляЗагрузки.Контрагент,
	|	ТабДляЗагрузки.ДатаРождения,
	|	ТабДляЗагрузки.МестоРождения,
	|	ТабДляЗагрузки.Нпп
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	&ТабДляЗагрузки КАК ТабДляЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ДоговорыОПС.Ссылка КАК ДоговорОПС,
	|	ИсходныеДанные.СНИЛС,
	|	ИсходныеДанные.НомерДоговора,
	|	ИсходныеДанные.ДатаЗаключения,
	|	ИсходныеДанные.Фамилия,
	|	ИсходныеДанные.Имя,
	|	ИсходныеДанные.Отчество,
	|	ИсходныеДанные.Контрагент,
	|	ИсходныеДанные.ДатаРождения,
	|	ИсходныеДанные.МестоРождения,
	|	ИсходныеДанные.Нпп
	|ПОМЕСТИТЬ ДоговорыОПС
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уп_ДоговорыОПС КАК уп_ДоговорыОПС
	|		ПО ИсходныеДанные.СНИЛС = уп_ДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
	|			И (НАЧАЛОПЕРИОДА(ИсходныеДанные.ДатаЗаключения, ДЕНЬ) = НАЧАЛОПЕРИОДА(уп_ДоговорыОПС.ДатаЗаключения, ДЕНЬ))
	|			И ИсходныеДанные.НомерДоговора = уп_ДоговорыОПС.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыОПС.СНИЛС,
	|	ДоговорыОПС.НомерДоговора,
	|	ДоговорыОПС.ДатаЗаключения,
	|	ДоговорыОПС.Фамилия,
	|	ДоговорыОПС.Имя,
	|	ДоговорыОПС.Отчество,
	|	ДоговорыОПС.Контрагент,
	|	ДоговорыОПС.ДатаРождения,
	|	ДоговорыОПС.МестоРождения,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") КАК ФамилияРегистр,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """") КАК ИмяРегистр,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Отчество, """") КАК ОтчествоРегистр,
	#Удаление 
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник КАК ЗЛ,		
	#КонецУдаления 
	#Вставка 
	// +ХМНПФ 22.03.2016 ЛыткинАМ // ЗагрузитьПодтверждениеИзПФР() // №286
	|	ДоговорыОПС.ДоговорОПС,
	|	ДоговорыОПС.ДоговорОПС.Участник КАК ЗЛ,
	// -ХМНПФ 22.03.2016 ЛыткинАМ // ЗагрузитьПодтверждениеИзПФР() // №286		
	#КонецВставки
	|	уп_СостоянияДоговораОПССрезПоследних.Состояние,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРожденияБаза,
	|	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо.МестоРождения КАК МестоРожденияБаза,
	|	ДоговорыОПС.Нпп КАК Нпп
	|ИЗ
	|	ДоговорыОПС КАК ДоговорыОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(
	|				&ДатаДок,
	|				ДоговорОПС.Организация = &Организация
	|					И ДоговорОПС В
	|						(ВЫБРАТЬ
	|							ДоговорыОПС.ДоговорОПС
	|						ИЗ
	|							ДоговорыОПС КАК ДоговорыОПС)) КАК уп_СостоянияДоговораОПССрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДок, ) КАК ФИОФизЛицСрезПоследних
	|			ПО уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.Участник.уп_ФизЛицо = ФИОФизЛицСрезПоследних.ФизическоеЛицо
	|		ПО ДоговорыОПС.ДоговорОПС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Нпп";

	Запрос.УстановитьПараметр("ДатаДок", ДатаФормированияДокументов);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТабДляЗагрузки", ТЗ);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Всего = ВыборкаДетальныеЗаписи.Количество();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		#Если Клиент Тогда
			Состояние("Обработка строки "+ВыборкаДетальныеЗаписи.Нпп+" из "+Всего);
		#КонецЕсли
		Если ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
			ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
			Протокол.ДобавитьСтроку("Не найден договор об ОПС №"+ВыборкаДетальныеЗаписи.НомерДоговора+" от "+ВыборкаДетальныеЗаписи.ДатаЗаключения+" с "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
		ИначеЕсли ВыборкаДетальныеЗаписи.ЗЛ = NULL Тогда //не найден контрагент
			Протокол.ДобавитьСтроку("Не найден ЗЛ "+ВыборкаДетальныеЗаписи.СНИЛС);
		ИначеЕсли ВыборкаДетальныеЗаписи.ДоговорОПС = NULL Тогда //не найден договор
			ФИО = ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество;
			Протокол.ДобавитьСтроку("Не найден договор об ОПС №"+ВыборкаДетальныеЗаписи.НомерДоговора+" от "+ВыборкаДетальныеЗаписи.ДатаЗаключения+" с "+ФИО+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС);
		Иначе //все в порядке
			Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
				Протокол.ДобавитьСтроку("Договор №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" уже закрыт и не будет внесен в табличную часть!");
				Продолжить;
			КонецЕсли;	
			Если ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
				и ВыборкаДетальныеЗаписи.Состояние<>Перечисления.уп_СостоянияДоговоровОПС.Заключен  Тогда
				Протокол.ДобавитьСтроку("Обратите внимание!! Состояние договора №"+ВыборкаДетальныеЗаписи.ДоговорОПС.Код+" с "+ВыборкаДетальныеЗаписи.ДоговорОПС.Участник.Наименование+", страховой номер ПФР "+ВыборкаДетальныеЗаписи.СНИЛС+" = "+ВыборкаДетальныеЗаписи.Состояние);
				Продолжить;
			КонецЕсли;
			НовСтр = НовыйДокумент.ДоговорыОПС.Добавить();
			НовСтр.ДоговорОПС = ВыборкаДетальныеЗаписи.ДоговорОПС;
			НовСтр.Участник = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
			НовСтр.ПредыдущийСтраховщик = ВыборкаДетальныеЗаписи.Контрагент;

			Если КорректироватьДанныеЗЛ Тогда
				ИзмененоФИО = Ложь;
				ИзмененоДР = Ложь;
				ИзмененоМР = Ложь;
				//проверим дату рождения
				Если НачалоДня(ВыборкаДетальныеЗаписи.ДатаРождения)<>НачалоДня(ВыборкаДетальныеЗаписи.ДатаРожденияБаза) Тогда
					ИзмененоДР = Истина;
				КонецЕсли;
				//проверим место рождения
				Если ЗначениеЗаполнено(СокрЛП(ВыборкаДетальныеЗаписи.МестоРождения)) Тогда
					Если ВРЕГ(СокрЛП(ВыборкаДетальныеЗаписи.МестоРожденияБаза))<>ВРЕГ(СокрЛП(ВыборкаДетальныеЗаписи.МестоРождения)) Тогда
						ИзмененоМР = Истина;
					КонецЕсли;
				КонецЕсли;
				//проверим ФИО
				Если СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Фамилия))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ФамилияРегистр))
					ИЛИ СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Имя))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ИмяРегистр))
					ИЛИ СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.Отчество))<>СокрЛП(ВРЕГ(ВыборкаДетальныеЗаписи.ОтчествоРегистр)) Тогда
					ИзмененоФИО = Истина;
					Протокол.ДобавитьСтроку("Обратите внимание!! У физ. лица со СНИЛС "+ВыборкаДетальныеЗаписи.СНИЛС+" ФИО в реестре "+ВыборкаДетальныеЗаписи.Фамилия+" "+ВыборкаДетальныеЗаписи.Имя+" "+ВыборкаДетальныеЗаписи.Отчество+" <> ФИО в базе данных "+ВыборкаДетальныеЗаписи.ФамилияРегистр+" "+ВыборкаДетальныеЗаписи.ИмяРегистр+" "+ВыборкаДетальныеЗаписи.ОтчествоРегистр);
				КонецЕсли;	

				Если (ИзмененоФИО ИЛИ ИзмененоДР ИЛИ ИзмененоМР) И КорректироватьДанныеЗЛ Тогда
					НовСтрКорректировки = ДокКорректировки.ЗастрахованныеЛица.Добавить();
					НовСтрКорректировки.Корректировать = Истина;
					НовСтрКорректировки.ЗЛ = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
					НовСтрКорректировки.ИзмененоФИО = ИзмененоФИО;
					НовСтрКорректировки.ФИОПоБазе = СокрЛП(ВыборкаДетальныеЗаписи.ФамилияРегистр)+" "+СокрЛП(ВыборкаДетальныеЗаписи.ИмяРегистр)+" "+СокрЛП(ВыборкаДетальныеЗаписи.ОтчествоРегистр);
					НовСтрКорректировки.ФИОПоРеестру = СокрЛП(ВыборкаДетальныеЗаписи.Фамилия)+" "+СокрЛП(ВыборкаДетальныеЗаписи.Имя)+" "+СокрЛП(ВыборкаДетальныеЗаписи.Отчество);
					НовСтрКорректировки.ИзмененаДР = ИзмененоДР;
					НовСтрКорректировки.ДРПоБазе = ВыборкаДетальныеЗаписи.ДатаРожденияБаза;
					НовСтрКорректировки.ДРПоРеестру = ВыборкаДетальныеЗаписи.ДатаРождения;
					НовСтрКорректировки.ИзмененоМестоРождения = ИзмененоМР;
					НовСтрКорректировки.МРПоБазе = ВыборкаДетальныеЗаписи.МестоРожденияБаза;
					НовСтрКорректировки.МРПоРеестру = ВыборкаДетальныеЗаписи.МестоРождения;
				КонецЕсли;	
			КонецЕсли;

		КонецЕсли;	
	КонецЦикла;

	Если НовыйДокумент.ДоговорыОПС.Количество() > 0 Тогда
		НовыйДокумент.Записать();
		НовоеНачисление = НовыеНачисления.Добавить();
		НовоеНачисление.Документ = НовыйДокумент.Ссылка;
		НовоеНачисление.Комментарий = НовыйДокумент.Комментарий;

		Протокол.ДобавитьСтроку("Записан документ "+НовыйДокумент.Ссылка);
		Протокол.Добавитьстроку("Файл загружен.");
		СтрФайлов = ЗагруженныеФайлы.Добавить();
		СтрФайлов.ИмяФайла = ИмяФайла;

		Если КорректироватьДанныеЗЛ Тогда
			Если ДокКорректировки.ЗастрахованныеЛица.Количество()>0 Тогда
				ДокКорректировки.Записать();
				НовоеНачисление = НовыеНачисления.Добавить();
				НовоеНачисление.Документ = ДокКорректировки.Ссылка;
				НовоеНачисление.Комментарий = НовыйДокумент.Комментарий;
				Протокол.ДобавитьСтроку("Записан документ "+ДокКорректировки.Ссылка);
			КонецЕсли;	
		КонецЕсли;	

	Иначе
		Сообщить("Документ не записан, т.к. нет строк в табличной части (файл: " + ИмяФайла + " ).");
	КонецЕсли;
КонецПроцедуры
